Autodesk.Revit.DB.Structure.Truss.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Curve)
Creates a new Truss.
document:
The document in which the new Truss is created.
trussTypeId:
Element id of the truss type.
sketchPlaneId:
Element id of a SketchPlane.
curve:
The curve of the truss element.
It must be a line, must not be a vertical line, and must be within the sketch plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve points to a helical curve and is not supported for this operation.
-or-
The element id should refer to a valid TrussType.
-or-
The element id should refer to a valid SketchPlane.
-or-
The curve is invalid to be the base curve of a truss.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This function is only enabled in Revit Structure and Revit Architecture.
-or-
Failed to create Truss element.
Since:
2014

Autodesk.Revit.DB.Structure.Truss.DropTruss(Autodesk.Revit.DB.Structure.Truss)
Drop truss Family, it will disassociate all members from the truss and delete the truss.
truss: The truss to be dropped.
Since: 2011

Autodesk.Revit.DB.Structure.Truss.TogglePinMember(Autodesk.Revit.DB.ElementId)
Pin/Unpin a truss member.
elemId: The member element is going to pin/unpin.

Autodesk.Revit.DB.Structure.Truss.GetTrussMemberInfo(Autodesk.Revit.DB.ElementId)
Query if a given element is a member of a truss, its lock status and its usage, etc.
elemId: The querying element.
Returns: A struct TrussMemberInfo that contains the querying element's host truss, whether to lock to the truss, usage type, etc.

Autodesk.Revit.DB.Structure.Truss.RemoveProfile
Remove the profile of a truss.

Autodesk.Revit.DB.Structure.Truss.SetProfile(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.CurveArray)
Add or modify the profile of a truss.
topChords: The curves serving as top chords of the truss.
bottomChords: The curves serving as bottom chords of the truss.

Autodesk.Revit.DB.Structure.Truss.DetachChord(Autodesk.Revit.DB.Structure.TrussChordLocation)
Detach a truss's specific chord from the element to which it is attached.
location: The chord.
Since: 2011

Autodesk.Revit.DB.Structure.Truss.AttachChord(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Structure.TrussChordLocation,System.Boolean)
Attach a truss's specific chord to a specified element, the element should be a roof or floor.
attachToElement: The element to which the truss's chord will attach. The element should be a roof or floor.
location: The chord need to be attached.
forceRemoveSketch: Whether to detach the original sketch if there is one.
Since: 2011

Autodesk.Revit.DB.Structure.Truss.TrussType
Retrieve/set an object that represents the type of the truss.

Autodesk.Revit.DB.Structure.Truss.Curves
Get all the truss curves.
Returns: The Curves property returns a CurveArray
that contains all the truss curves.

Autodesk.Revit.DB.Structure.Truss.Members
Get all the members of truss.
Returns: The Members property returns an ElementIdSet
that contains all the member Ids of truss.

Autodesk.Revit.DB.Structure.Truss
Represents all kinds of Trusses.
Remarks:
The Truss object represents all the kinds of Trusses in Revit.
The TrussType property is used to distinguish the type of the Truss.